app/views/users/show.html.erb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 2
SELECT 1 AS one FROM `tweets` WHERE `tweets`.`user_id` = 2 LIMIT 1
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 3
---

<% if @user.tweets.exists? %>
<div class="tweets-container">
  <% @user.tweets.each do |t| %>