app/helpers/notifications_helper.rb

    def notification_form(notification)
        #通知を送ってきたユーザーを取得
        @visitor = notification.visitor
        #コメントの内容を通知に表示する
        @comment = nil
        @visitor_comment = notification.comment_id
        # notification.actionがfollowかlikeかcommentかで処理を変える
        case notification.action
        when 'follow'
          #aタグで通知を作成したユーザーshowのリンクを作成
          tag.a(notification.visitor.name, href: user_path(@visitor)) + 'があなたをフォローしました'
        when 'comment' then
          #コメントの内容と投稿のタイトルを取得
          @comment = Comment.find_by(id: @visitor_comment)
---
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 4 LIMIT 1