app/controllers/comments_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 5 LIMIT 1
INSERT INTO `comments` (`comment`, `user_id`, `created_at`, `updated_at`, `tweet_id`) VALUES ('てすと', 2, '2020-04-26 15:46:21.181895', '2020-04-26 15:46:21.181895', 5)
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `tweet_id`, `comment_id`, `action`, `checked`, `created_at`, `updated_at`) VALUES (2, 2, 6, 8, 'comment', TRUE, '2020-04-30 07:45:06.783233', '2020-04-30 07:45:06.783233')
---
  def create
    tweet = Tweet.find(params[:tweet_id])
    @comment = tweet.comments.build(comment_params)
    @comment.user_id = current_user.id
    if @comment.save
      flash[:success] = "コメントしました"
      #通知機能
      @tweet = @comment.tweet
      @tweet.create_notification_comment!(current_user, @comment.id)

DELETE FROM `comments` WHERE `comments`.`id` = 3
SELECT `comments`.* FROM `comments` WHERE `comments`.`id` = 3 LIMIT 1
---
  def destroy
    Comment.find(params[:id]).destroy