app/controllers/messages_controller.rb

SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 2 AND `entries`.`room_id` IS NULL
INSERT INTO `messages` (`content`, `user_id`, `room_id`, `created_at`, `updated_at`) VALUES ('こんにちは', 3, 1, '2020-04-28 06:46:30.158252', '2020-04-28 06:46:30.158252')
---
  def create
    if Entry.where(:user_id => current_user.id, :room_id => params[:message][:room_id]).present?
      @message = Message.create(params.require(:message).permit(:user_id, :content, :room_id).merge(:user_id => current_user.id))