app/controllers/notifications_controller.rb

UPDATE `notifications` SET `notifications`.`checked` = TRUE, `notifications`.`updated_at` = '2020-04-29 16:40:39.926227' WHERE `notifications`.`id` = 1
---
    def index
        @notifications = current_user.passive_notifications
        #通知画面を開くとcheckedをtrueにして通知確認済にする
        @notifications.where(checked: false).each do |notification|
          notification.update_attributes(checked: true)

DELETE FROM `notifications` WHERE `notifications`.`id` = 3
---
    def destroy
        @notifications =current_user.passive_notifications.destroy_all