app/controllers/relationships_controller.rb

  def create
    @user = User.find(params[:relationship][:following_id])
    current_user.follow!(@user)
    #通知機能
    @user.create_notification_follow!(current_user)
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `action`, `created_at`, `updated_at`) VALUES (4, 2, 'follow', '2020-04-29 17:04:09.150721', '2020-04-29 17:04:09.150721')
INSERT INTO `relationships` (`follower_id`, `following_id`, `created_at`, `updated_at`) VALUES (3, 2, '2020-04-28 06:47:32.816279', '2020-04-28 06:47:32.816279')

  def destroy
    @user = Relationship.find(params[:id]).following
---
SELECT `relationships`.* FROM `relationships` WHERE `relationships`.`id` = 5 LIMIT 1