app/controllers/rooms_controller.rb

INSERT INTO `rooms` (`created_at`, `updated_at`) VALUES ('2020-04-28 06:46:22.235505', '2020-04-28 06:46:22.235505')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (3, 1, '2020-04-28 06:46:22.254495', '2020-04-28 06:46:22.254495')
INSERT INTO `entries` (`user_id`, `room_id`, `created_at`, `updated_at`) VALUES (2, 1, '2020-04-28 06:46:22.270591', '2020-04-28 06:46:22.270591')
---
  def create
    @room = Room.create
    @entry1 = Entry.create(:room_id => @room.id, :user_id => current_user.id)
    @entry2 = Entry.create(params.require(:entry).permit(:user_id, :room_id).merge(:room_id => @room.id))

SELECT `rooms`.* FROM `rooms` WHERE `rooms`.`id` = 1 LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 3 AND `entries`.`room_id` = 1
---
  def show
    @room = Room.find(params[:id])
    if Entry.where(:user_id => current_user.id, :room_id => @room.id).present?