app/controllers/tweets_controller.rb

INSERT INTO `tweets` (`body`, `user_id`, `created_at`, `updated_at`) VALUES ('test', 2, '2020-03-20 14:11:45.848283', '2020-03-20 14:11:45.848283')
---
  def create
    @tweet = Tweet.new(tweet_params)
    @tweet.user_id = current_user.id
    if @tweet.save

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 5 LIMIT 1
SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`tweet_id` = 5
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 1 LIMIT 1
---
  def show
    @tweet = Tweet.find(params[:id])
    @comments = @tweet.comments.includes(:user)

DELETE FROM `tweets` WHERE `tweets`.`id` = 5
SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`id` = 5 LIMIT 1
---
  def destroy
    Tweet.find(params[:id]).destroy