app/controllers/users_controller.rb

SELECT `tweets`.* FROM `tweets` WHERE `tweets`.`user_id` = 2
SELECT `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 3
SELECT `entries`.* FROM `entries` WHERE `entries`.`user_id` = 2
---
  def show
    @tweet = Tweet.all
    @user = User.find(params[:id])
    @currentUserEntry=Entry.where(user_id: current_user.id)
    @userEntry=Entry.where(user_id: @user.id)
    if @user.id == current_user.id
    else
      @currentUserEntry.each do |cu|
        @userEntry.each do |u|

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def following
    @user  = User.find(params[:id])

SELECT `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  def followers
    @user  = User.find(params[:id])