app/models/tweet.rb

    def create_notification_comment!(current_user, comment_id)
        #同じ投稿にコメントしているユーザーに通知を送る。（current_userと投稿ユーザーのぞく）
        temp_ids = Comment.where(tweet_id: id).where.not("user_id=? or user_id=?", current_user.id,user_id).select(:user_id).distinct
        #取得したユーザー達へ通知を作成。（user_idのみ繰り返し取得）
        temp_ids.each do |temp_id|
---
SELECT DISTINCT `comments`.`user_id` FROM `comments` WHERE `comments`.`tweet_id` = 7 AND NOT (user_id=2 or user_id=3)

    def save_notification_comment!(current_user, comment_id, visited_id)
        notification = current_user.active_notifications.new(
          tweet_id: id,
          comment_id: comment_id,
          visited_id: visited_id,
          action: 'comment'
        )
        if notification.visitor_id == notification.visited_id
          notification.checked = true
        end
        notification.save if notification.valid?
---
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `tweet_id`, `comment_id`, `action`, `checked`, `created_at`, `updated_at`) VALUES (2, 2, 6, 8, 'comment', TRUE, '2020-04-30 07:45:06.783233', '2020-04-30 07:45:06.783233')