app/models/user.rb

  def follow!(other_user)
    following_relationships.create!(following_id: other_user.id)
---
INSERT INTO `relationships` (`follower_id`, `following_id`, `created_at`, `updated_at`) VALUES (3, 2, '2020-04-28 06:47:32.816279', '2020-04-28 06:47:32.816279')

  def unfollow!(other_user)
    following_relationships.find_by(following_id: other_user.id).destroy
---
DELETE FROM `relationships` WHERE `relationships`.`id` = 1

  def create_notification_follow!(current_user)
    #すでに通知が作成されているか確認
    temp = Notification.where(["visitor_id = ? and visited_id = ? and action = ? ",current_user.id, id, 'follow'])
    if temp.blank?
      notification = current_user.active_notifications.new(
        visited_id: id,
        action: 'follow'
      )
      notification.save if notification.valid?
---
SELECT `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
SELECT `notifications`.* FROM `notifications` WHERE (visitor_id = 4 and visited_id = 2 and action = 'follow' ) ORDER BY `notifications`.`created_at` DESC
INSERT INTO `notifications` (`visitor_id`, `visited_id`, `action`, `created_at`, `updated_at`) VALUES (4, 2, 'follow', '2020-04-29 17:04:09.150721', '2020-04-29 17:04:09.150721')